# Data analisis dan visualisasi data teknikal finance menggunakan piton

### bagaiaman cara menggunakan python library seperti pandas, matplotlib dan seaborn untuk mendapatakan insights dari data harga volum stock harian dari pasar saham

# 1. Tentang Data nya

For this analysis, 2 years of historical data from around mid-Feb 2018 to Feb 2020 of the below stocks listed on National Stock Exchange(NSE)— https://www1.nseindia.com/global/content/about_us/about_us.htm were used.

- HDFC Ltd.
- Sun Pharmaceutical Industries Ltd.
- Tata Consultancy Services Ltd.
- Jindal Steel & Power Ltd.
- Jubilant FoodWorks Ltd.

The selected stocks are from different sectors and market cap. For the start, we’ll investigate the HDFC stock individually and then move on to the combined analysis. For this section, the csv file of historical data of HDFC stock has been downloaded from Yahoo finance https://in.finance.yahoo.com/.

# 2. Data Understanding and General Statistics

import necessary libraries

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import datetime
import warnings
warnings.filterwarnings('ignore')

Read data from csv file and display first few rows

In [3]:
HDFC_df = pd.read_csv("Salinan HDFCBANK.NS.csv")
HDFC_df.head()

,Date,Open,High,Low,Close,Adj Close,Volume
0,2018-02-15,944.849976,947.375000,937.500000,940.950012,927.139465,2457612.0
1,2018-02-16,941.950012,947.424988,937.825012,939.299988,925.513611,1791760.0
2,2018-02-19,941.299988,943.799988,929.525024,939.099976,925.316528,1827276.0
3,2018-02-20,942.375000,942.924988,929.400024,931.599976,917.926697,2042034.0
4,2018-02-21,933.974976,934.275024,926.099976,928.700012,915.069214,1376536.0

since out time-frame of analysis is large, we can relax on number of decimal places to consider.

In [4]:
HDFC_df = HDFC_df.round(2)
HDFC_df.head()

         Date    Open    High     Low   Close  Adj Close     Volume
0  2018-02-15  944.85  947.38  937.50  940.95     927.14  2457612.0
1  2018-02-16  941.95  947.42  937.83  939.30     925.51  1791760.0
2  2018-02-19  941.30  943.80  929.53  939.10     925.32  1827276.0
3  2018-02-20  942.38  942.92  929.40  931.60     917.93  2042034.0
4  2018-02-21  933.97  934.28  926.10  928.70     915.07  1376536.0

better! lets determine the shape of dataset

In [5]:
HDFC_df.shape

(491, 7)

In [9]:
HDFC_df.isnull().sum()

Date         0
Open         0
High         0
Low          0
Close        0
Adj Close    0
Volume       0
dtype: int64

kita buang yang null

In [8]:
HDFC_df.dropna(inplace=True, axis=0)

kita cek juga data type tiap column nya

In [10]:
HDFC_df.dtypes

Date          object
Open         float64
High         float64
Low          float64
Close        float64
Adj Close    float64
Volume       float64
dtype: object

ternyata untuk kolom date nya harus diubah ke datetime
kita pake pandas untuk merubah date ke datetime

In [11]:
HDFC_df["Date"] = pd.to_datetime(HDFC_df["Date"])
HDFC_df.head()

        Date    Open    High     Low   Close  Adj Close     Volume
0 2018-02-15  944.85  947.38  937.50  940.95     927.14  2457612.0
1 2018-02-16  941.95  947.42  937.83  939.30     925.51  1791760.0
2 2018-02-19  941.30  943.80  929.53  939.10     925.32  1827276.0
3 2018-02-20  942.38  942.92  929.40  931.60     917.93  2042034.0
4 2018-02-21  933.97  934.28  926.10  928.70     915.07  1376536.0

In [12]:
HDFC_df.dtypes

Date         datetime64[ns]
Open                float64
High                float64
Low                 float64
Close               float64
Adj Close           float64
Volume              float64
dtype: object

data date sudah berubah ke format datetime

In [13]:
type(HDFC_df.loc[0, "Date"])

pandas._libs.tslibs.timestamps.Timestamp

lalu kita mengambil data date dari terakhir hingga pertama

In [14]:
HDFC_df["Date"].max() - HDFC_df["Date"].min()

Timedelta('729 days 00:00:00')

kita ngambil data 90 hari terakhir dari awal data

In [18]:
HDFC_df.dtypes

Date         datetime64[ns]
Open                float64
High                float64
Low                 float64
Close               float64
Adj Close           float64
Volume              float64
dtype: object

ada beberapa error tadi, karna tutorial nya masih lama, jadi ada beberap perubahan di pandas version terbaru, sehingga seharusnya date tidak terikut, namun masih terikut di operasi describe

solusi nya = menggunakan slect_dtypes untuk filter tipe data yang diinginkan

In [20]:
HDFC_df.iloc[-90:].select_dtypes(include=["number"]).describe().astype(int)

       Open  High   Low  Close  Adj Close    Volume
count    90    90    90     90         90        90
mean   1255  1263  1243   1252       1252   5973670
std      24    22    25     24         24   1824496
min    1197  1197  1177   1186       1186   1836849
25%    1242  1248  1227   1239       1239   4651834
50%    1256  1262  1243   1253       1253   5792594
75%    1276  1281  1264   1272       1272   6685996
max    1305  1305  1288   1302       1302  11256610